cask_args appdir: "/Applications"

tap "armmbed/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "qmk/qmk"

brew "mas"

mas "10ten Japanese Reader", id: 1573540634
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "Compressor", id: 424390742
#mas "Controller", id: 1198176727
mas "Dark Reader for Safari", id: 1438243180
mas "Disk Speed Test", id: 425264550
#mas "EasyRes", id: 688211836
mas "Final Cut Pro", id: 424389933
mas "Furiganify!", id: 1151320968
mas "Hush", id: 1544743900
mas "Logic Pro", id: 634148309
mas "LyricsX", id: 1254743014
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "PiPer", id: 1421915518
mas "Pixelmator Pro", id: 1289583905
mas "PopClip", id: 445189367
mas "Safarikai", id: 1437951175
mas "Silicio", id: 933627574
mas "SmileAllDay", id: 1180442868
mas "SpoticaMenu", id: 570549457
mas "Tampermonkey", id: 1482490089
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Tweaks for Reddit", id: 1524828965
mas "Vectornator", id: 1219074514
mas "WireGuard", id: 1451685025
mas "Yoink", id: 457622435


brew "aria2"
brew "autoconf"
brew "python"
brew "autojump"
brew "automake"
brew "bat"
brew "blueutil"
brew "brew-cask-completion"
brew "gettext"
brew "git"
brew "glib"
brew "pkg-config"
brew "pixman"
brew "cmake"
brew "coreutils"
brew "deno"
brew "fd"
brew "gnutls"
brew "srt"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "gnupg"
brew "go"
brew "gotop"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lf"
brew "llvm"
brew "lsd"
brew "luarocks"
brew "moreutils"
brew "n"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "pandoc"
brew "pure"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "the_silver_searcher"
brew "timg"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "util-linux"
brew "vim"
brew "wget"
brew "zsh"

cask "anki"
cask "appcleaner"
cask "bettertouchtool"
cask "contexts"
cask "disk-inventory-x"
cask "firefox"
cask "kitty"
cask "font-charter"
cask "font-fira-code"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "font-noto-nerd-font"
cask "font-noto-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "forklift"
cask "hammerspoon"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "keka"
cask "little-snitch"
cask "mpv"
cask "pdf-expert"
cask "soundsource"
cask "transmission"
cask "typinator"
cask "xld"


#optional

#mas "Xcode", id: 497799835
#cask "chiaki"
#cask "epic-games"
#cask "imazing"
#cask "historyhound"
#cask "league-of-legends"
#cask "openemu"
#brew "qmk"
#cask "qmk-toolbox"
#cask "sf-symbols"
#cask "steam"
#cask "sweet-home3d"
#cask "tor-browser"
#cask "steermouse"
